src/main/resources/templates/registra-aiuto.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webServices.raseWeb.rase.rnas.infocamere.it/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:RegistraAiuto>
         <codiceBando>$codiceBando</codiceBando>
         <fileXml><![CDATA[$attach]]></fileXml>
      </web:RegistraAiuto>
   </soapenv:Body>
</soapenv:Envelope>