src/main/resources/templates/reitera-registra-aiuto.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webServices.raseWeb.rase.rnas.infocamere.it/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:ReiteraRegistraAiuto>
         <idRichiesta>$idRichiesta</idRichiesta>
         <idConcessioneGest>$idConcessioneGest</idConcessioneGest>
      </web:ReiteraRegistraAiuto>
   </soapenv:Body>
</soapenv:Envelope>