src/main/resources/templates/annulla-concessione.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webServices.raseWeb.rase.rnas.infocamere.it/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:AnnullaConcessione>
         <cor>$cor</cor>
         <notifica>$notifica</notifica>
      </web:AnnullaConcessione>
   </soapenv:Body>
</soapenv:Envelope>