src/main/resources/templates/scarica-visura.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webServices.raseWeb.rase.rnas.infocamere.it/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:ScaricaVisura>
         <idRichiesta>$idRichiesta</idRichiesta>
         <outputVisura>$outputVisura</outputVisura>
      </web:ScaricaVisura>
   </soapenv:Body>
</soapenv:Envelope>