src/main/resources/templates/richiedi-visura-aiuti.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webServices.raseWeb.rase.rnas.infocamere.it/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:RichiediVisuraAiuti>
         <codiceFiscale>$codiceFiscale</codiceFiscale>
      </web:RichiediVisuraAiuti>
   </soapenv:Body>
</soapenv:Envelope>